XMegaForArduino/arduino/variants/xmega128a1u/pins_arduino.h
// NOTE:  because it's got USB on port D pins 6,7 I can't have a serial port there
//// serial port 4
//#define SERIAL_4_PORT_NAME PORTD
//#define SERIAL_4_USART_NAME USARTD1
//#define SERIAL_4_USART_DATA USARTD1_DATA
//#define SERIAL_4_RXC_ISR ISR(USARTD1_RXC_vect)
//#define SERIAL_4_DRE_ISR ISR(USARTD1_DRE_vect)
//#define SERIAL_4_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
//#define SERIAL_4_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
//#define USARTD1_VECTOR_EXISTS

// serial port 4
#define SERIAL_4_PORT_NAME PORTC
#define SERIAL_4_USART_NAME USARTC1
#define SERIAL_4_USART_DATA USARTC1_DATA
#define SERIAL_4_RXC_ISR ISR(USARTC1_RXC_vect)
#define SERIAL_4_DRE_ISR ISR(USARTC1_DRE_vect)
#define SERIAL_4_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_4_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTC1_VECTOR_EXISTS

// serial port 5
#define SERIAL_5_PORT_NAME PORTE
#define SERIAL_5_USART_NAME USARTE1
#define SERIAL_5_USART_DATA USARTE1_DATA
#define SERIAL_5_RXC_ISR ISR(USARTE1_RXC_vect)
#define SERIAL_5_DRE_ISR ISR(USARTE1_DRE_vect)
#define SERIAL_5_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_5_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTE1_VECTOR_EXISTS

// serial port 6
#define SERIAL_6_PORT_NAME PORTF
#define SERIAL_6_USART_NAME USARTF1
#define SERIAL_6_USART_DATA USARTF1_DATA
#define SERIAL_6_RXC_ISR ISR(USARTF1_RXC_vect)
#define SERIAL_6_DRE_ISR ISR(USARTF1_DRE_vect)
#define SERIAL_6_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_6_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTF1_VECTOR_EXISTS


// For atmega/Arduino shield compatibility, with DIGITAL_IO_PIN_SHIFT defined
// typical board/pin layout might be like this:
//
//
//                                                                 R I
//                                                                 E O N
//                    A A A A A A                        V G G 3   S R .
//                    1 1 1 1 1 1 A A   A A A A A A A A  I N N V 5 E E C
//                    5 4 3 2 1 0 9 8   7 6 5 4 3 2 1 0  n D D 3 V T F .
//              {  } -o-o-o-o-o-o-o-o---o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o-----------
//                    P P P P P P P P   P P P P P P P P        3 5   3
//      55 -o-o       A B B B B B B B   B A A A A A A A        V V   V
//      53 -o-o       0 7 6 5 4 3 2 1   0 7 6 5 4 3 2 1        3     3
//      51 -o-o
//      49 -o-o 48
//      47 -o-o 46
//      45 -o-o 44
//      43 -o-o 42
//      41 -o-o 40
//      39 -o-o 38
//      37 -o-o 36                     T O P   V I E W
//      35 -o-o 34
//      33 -o-o 32
//      31 -o-o 30
//      29 -o-o 28
//      27 -o-o                             P P                             P P P
//      25 -o-o                             D D                             A C C
//      23 -o-o                             2 3                             0 1 0
//         -o-o {  } -----o-o-o-o-o-o-o-o---o-o-o-o-o-o---o-o-o-o-o-o-o-o-o-o-o-o---
//          5 5           2 2 1 1 1 1 1 1                         1 1 1 1 G A S S
//          V V           1 0 9 8 7 6 5 4   0 1 2 3 4 5   6 7 8 9 0 1 2 3 N R C D
//                        S S R T R T R T   R T                   S M M S D E L A
//                        C D x x x x x x   x x                   S O I C   F
//                        L A 1 1 2 2 3 3   0 0                     S S K
//                                                                  I O
//
// As with other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.
//
// This layout is based on the 'Rev 3' Arduino mega 2560.
//
// NOTE - NO AREF:  AREF is not connected.  AREF is a bit of an issue on xmega because
// it DOES! NOT! WORK! THE! SAME! as it does on the ATmegaXXX and so you would need to
// (literally) steal one of the additional analog input pins to implement it. It's not
// impossible, or even THAT difficult.  I'm just not doing it here.
//
// NOTE 2:  'AREF' must either be A0 or B0, no compromise otherwise.  It *could* be
//          dual-connected to either pin, however.  In that case, the AREF pin should
//          be moved in the pin order to correspond to A15



#ifdef DIGITAL_IO_PIN_SHIFT // aka digital I/O pin 0 is PORTD pin 2

// SHIFTED I/O pins (atmega compatibility) - see xmega mod description in comment at top

// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PE0,PE1 - TWIE
// NOTE:  this does NOT correspond to the mega2560, which uses 20 and 21 (need more remap work)
static const uint8_t SDA = 14;
static const uint8_t SCL = 15;
static const uint8_t SDA0 = 14; // TWIE
static const uint8_t SCL0 = 15;
static const uint8_t SDA1 = 6;  // TWIC
static const uint8_t SCL1 = 7;
static const uint8_t SDA2 = 59;  // TWID
static const uint8_t SCL2 = 60;
static const uint8_t SDA3 = 22; // TWIF
static const uint8_t SCL3 = 23;

// keep track of the indices for port R since its control register
// settings may be slightly different
#define PR0 58
#define PR1 59

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PE0,PE1 - TWIE
// NOTE:  this does NOT correspond to the mega2560, which uses 20 and 21 (need more remap work)
static const uint8_t SDA = 16;
static const uint8_t SCL = 17;
static const uint8_t SDA0 = 16;
static const uint8_t SCL0 = 17;
static const uint8_t SDA1 = 8;
static const uint8_t SCL1 = 9;
static const uint8_t SDA2 = 0;
static const uint8_t SCL2 = 1;
static const uint8_t SDA3 = 24;
static const uint8_t SCL3 = 25;

// TODO:  alternate 2-wire ports TWIC?

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 60
#define PR1 61

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PR1 /* Arduino 1.06 uses #define, not a const uint8_t */


