XMegaForArduino/arduino/variants/xmega128a1u/pins_arduino.h
#ifndef USE_AREF
  _BV( 0 ),  // PA 0 ** 62 ** A0
#endif // USE_AREF
  _BV( 1 ),  // PA 1 ** 63 ** A1
  _BV( 2 ),  // PA 2 ** 64 ** A2
  _BV( 3 ),  // PA 3 ** 65 ** A3
  _BV( 4 ),  // PA 4 ** 66 ** A4
  _BV( 5 ),  // PA 5 ** 67 ** A5
  _BV( 6 ),  // PA 6 ** 68 ** A6
  _BV( 7 ),  // PA 7 ** 69 ** A7
  _BV( 0 ),  // PB 0 ** 70 ** A8
  _BV( 1 ),  // PB 1 ** 71 ** A9
  _BV( 2 ),  // PB 2 ** 72 ** A10
  _BV( 3 ),  // PB 3 ** 73 ** A11
  _BV( 4 ),  // PB 4 ** 74 ** A12
  _BV( 5 ),  // PB 5 ** 75 ** A13
  _BV( 6 ),  // PB 6 ** 76 ** A14
  _BV( 7 ),  // PB 7 ** 77 ** A15
#ifdef USE_AREF
  _BV( 0 ),  // PA 0 ** 77 ** A15 (when USE_AREF is defined)
#endif // USE_AREF
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // for now 'NOT_ON_TIMER' for all - later, assign timers based
  // on pins 0-3 being enabled as PWM out for ports A through E
  // corresponding to timers A through D (see D manual sections 11.12.14,
  // also see D manual sect 13.6 for using the 'compare' channel on 'TCx2' to generate
  // a PWM output.  Must select pin as output, _AND_ enable the 'compare' output
  // for the appropriate pin.  LCMPENx/HCMPENx registers to enable it.

  // TODO:  correctly implement for xmega - PORTC, PORTD, and PORTE are all PWM capable!

#ifndef DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 0 ** 0 **
  TIMERD2,       // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 2 ** 2 ** USARTD_RX
  TIMERD2,       // PD 3 ** 3 ** USARTD_TX
  TIMERD2,       // PD 4 ** 4 **
  TIMERD2,       // PD 5 ** 5 **
  TIMERD2,       // PD 6 ** 6 **
  TIMERD2,       // PD 7 ** 7 **
  TIMERC2,       // PC 0 ** 8 ** SDA TWIC
  TIMERC2,       // PC 1 ** 9 ** SCL TWIC
  TIMERC2,       // PC 2 ** 10 ** USARTD_RX
  TIMERC2,       // PC 3 ** 11 ** USARTD_TX
  TIMERC2,       // PC 4 ** 12 ** SPI_SS
  TIMERC2,       // PC 5 ** 13 ** SPI_MOSI
  TIMERC2,       // PC 6 ** 14 ** SPI_MISO
  TIMERC2,       // PC 7 ** 15 ** SPI_SCK
  TIMERE2,       // PE 0 ** 16 ** SDA TWIE
  TIMERE2,       // PE 1 ** 17 ** SCL TWIE
  TIMERE2,       // PE 2 ** 18 **
  TIMERE2,       // PE 3 ** 19 **
  TIMERE2,       // PE 4 ** 20 **
  TIMERE2,       // PE 5 ** 21 **
  TIMERE2,       // PE 6 ** 22 **
  TIMERE2,       // PE 7 ** 23 **

  TIMERF2,       // PF 0 ** 24 **
  TIMERF2,       // PF 1 ** 25 **
  TIMERF2,       // PF 2 ** 26 **
  TIMERF2,       // PF 3 ** 27 **
  TIMERF2,       // PF 4 ** 28 **
  TIMERF2,       // PF 5 ** 29 **
  TIMERF2,       // PF 6 ** 30 **
  TIMERF2,       // PF 7 ** 31 **

  NOT_ON_TIMER,  // PH 0 ** 32 **
  NOT_ON_TIMER,  // PH 1 ** 33 **
  NOT_ON_TIMER,  // PH 2 ** 34 **
  NOT_ON_TIMER,  // PH 3 ** 35 **
  NOT_ON_TIMER,  // PH 4 ** 36 **
  NOT_ON_TIMER,  // PH 5 ** 37 **
  NOT_ON_TIMER,  // PH 6 ** 38 **
  NOT_ON_TIMER,  // PH 7 ** 39 **

  NOT_ON_TIMER,  // PJ 0 ** 40 **
  NOT_ON_TIMER,  // PJ 1 ** 41 **
  NOT_ON_TIMER,  // PJ 2 ** 42 **
  NOT_ON_TIMER,  // PJ 3 ** 43 **
  NOT_ON_TIMER,  // PJ 4 ** 44 **
  NOT_ON_TIMER,  // PJ 5 ** 45 **
  NOT_ON_TIMER,  // PJ 6 ** 46 **
  NOT_ON_TIMER,  // PJ 7 ** 47 **

  NOT_ON_TIMER,  // PK 0 ** 48 **
  NOT_ON_TIMER,  // PK 1 ** 49 **
  NOT_ON_TIMER,  // PK 2 ** 50 **
  NOT_ON_TIMER,  // PK 3 ** 51 **
  NOT_ON_TIMER,  // PK 4 ** 52 **
  NOT_ON_TIMER,  // PK 5 ** 53 **
  NOT_ON_TIMER,  // PK 6 ** 54 **
  NOT_ON_TIMER,  // PK 7 ** 55 **

  NOT_ON_TIMER,  // PQ 0 ** 56 **
  NOT_ON_TIMER,  // PQ 1 ** 57 **
  NOT_ON_TIMER,  // PQ 2 ** 58 **
  NOT_ON_TIMER,  // PQ 3 ** 59 **

  NOT_ON_TIMER,  // PR 0 ** 60 **
  NOT_ON_TIMER,  // PR 1 ** 61 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 0 ** the new 60 **
  TIMERD2,       // PD 1 ** the new 61 **
#endif // DIGITAL_IO_PIN_SHIFT

#ifndef USE_AREF
  NOT_ON_TIMER,  // PA 0 ** 62 ** A0
#endif // USE_AREF
  NOT_ON_TIMER,  // PA 1 ** 63 ** A1
  NOT_ON_TIMER,  // PA 2 ** 64 ** A2
  NOT_ON_TIMER,  // PA 3 ** 65 ** A3
  NOT_ON_TIMER,  // PA 4 ** 66 ** A4
  NOT_ON_TIMER,  // PA 5 ** 67 ** A5
  NOT_ON_TIMER,  // PA 6 ** 68 ** A6
  NOT_ON_TIMER,  // PA 7 ** 69 ** A7
  NOT_ON_TIMER,  // PB 0 ** 70 ** A8
  NOT_ON_TIMER,  // PB 1 ** 71 ** A9
  NOT_ON_TIMER,  // PB 2 ** 72 ** A10
  NOT_ON_TIMER,  // PB 3 ** 73 ** A11
  NOT_ON_TIMER,  // PB 4 ** 74 ** A12
  NOT_ON_TIMER,  // PB 5 ** 75 ** A13
  NOT_ON_TIMER,  // PB 6 ** 76 ** A14
  NOT_ON_TIMER,  // PB 7 ** 77 ** A15
#ifdef USE_AREF
  NOT_ON_TIMER   // PA 0 ** 77 ** A15 (when USE_AREF is defined)
#endif // USE_AREF

};

#endif // ARDUINO_MAIN


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif // Pins_Arduino_h


